cfd/naca0012/baseCase/naca0012_SA_familyII5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    front
    {
        type            empty;
        nFaces          57344;
        startFace       114208;
    }
    back
    {
        type            empty;
        nFaces          57344;
        startFace       171552;
    }
    airfoil
    {
        type            wall;
        nFaces          256;
        startFace       228896;
    }
    farfield
    {
        type            patch;
        nFaces          704;
        startFace       229152;
    }
)

// ************************************************************************* //
